<?php

$content = array();

$content['title'] = "Καλωσήλθατε στο LeafPHP Framework";

$content['intro'] = "Τα σύγχρονα PHP Frameworks είναι αρκετά περίπλοκα καθώς περιέχουν πολλαπλές παραμετροποιήσεις και προϋποθέτουν σχετική εμπειρία στο web development για να τα χρησιμοποιήσουν οι ενδιαφερόμενοι. Το LeafPHP Framework δημιουργήθηκε για να βοηθήσει τους νέους web developers να κατανοήσουν την λογική ενός PHP Framework, καθώς και την δομή ενός MVC μοντέλου.
                     Συγκεκριμένα, το LeafPHP είναι ένα lite PHP Framework παρέχοντας τις βασικές λειτουργίες για να είναι εύκολο στην κατανόηση από νέους προγραμματιστές. ";


return $content;
?>

