<?php

$data = array();

$data['title'] = "Καλωσήλθατε στο LeafPHP Framework";

$data['intro'] = "Τα σύγχρονα PHP Frameworks είναι αρκετά περίπλοκα καθώς 
                     περιέχουν πολλαπλές παραμετροποιήσεις και προϋποθέτουν σχετική 
                     εμπειρία στο web development για να τα χρησιμοποιήσουν οι ενδιαφερόμενοι. Το LeafPHP Framework δημιουργήθηκε για να βοηθήσει τους νέους web developers να κατανοήσουν την λογική ενός PHP Framework, καθώς και την δομή ενός MVC μοντέλου.
                     Συγκεκριμένα, το LeafPHP είναι ένα lite PHP Framework παρέχοντας τις βασικές λειτουργίες για να είναι εύκολο στην κατανόηση από νέους προγραμματιστές. 
                     <br><br>
                     Ένα PHP framework είναι ένα λογισμικό πλαίσιο που έχει σχεδιαστεί ειδικά για τη διευκόλυνση και τον επιταχυντικό 
                     ρόλο στην ανάπτυξη ιστοσελίδων και εφαρμογών στον διακομιστή χρησιμοποιώντας τη γλώσσα προγραμματισμού PHP. 
                     Τα πλαίσια (frameworks) παρέχουν μια δομημένη βάση και ένα σύνολο προκαθορισμένων εργαλείων, βιβλιοθηκών και 
                     συμβάσεων που βοηθούν τους προγραμματιστές να δημιουργήσουν αξιόπιστες, επεκτάσιμες και συντηρήσιμες εφαρμογές.";

return $data;
?>

